Ran Plan for dir: `terragrunt/kubernetes/metallb` workspace: `terragrunt_kubernetes_metallb`

<details><summary>Show Output</summary>

```diff
Authenticated

01:00:58.707 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/dgYOXqs4BHsX25uh0SCg-J3lurI/HUqQQsKfooOrvo-booW15Fp9x3g
01:00:58.737 INFO   tofu: Initializing the backend...
01:00:59.020 INFO   tofu: Initializing provider plugins...
01:00:59.020 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:59.271 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:59.573 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:59.703 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:59.815 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:59.931 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:00.032 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:00.159 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:00.273 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:00.308 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:00.329 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:01:00.365 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:00.379 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:00.453 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:00.472 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:00.483 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:00.484 INFO   tofu: OpenTofu has been successfully initialized!
01:01:01.106 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:01.106 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:01.106 STDOUT tofu:   ~ update in-place
01:01:01.106 STDOUT tofu: OpenTofu will perform the following actions:
01:01:01.106 STDOUT tofu:   # helm_release.metallb will be updated in-place
01:01:01.106 STDOUT tofu:   ~ resource "helm_release" "metallb" {
01:01:01.106 STDOUT tofu:       ~ id                         = "metallb" -> (known after apply)
01:01:01.106 STDOUT tofu:       ~ metadata                   = {
01:01:01.106 STDOUT tofu:           ~ app_version    = "v0.14.9" -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ chart          = "metallb" -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ first_deployed = 1746987657 -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ last_deployed  = 1746987657 -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ name           = "metallb" -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ namespace      = "metallb-system" -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ revision       = 1 -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ values         = jsonencode(
01:01:01.106 STDOUT tofu:                 {
01:01:01.106 STDOUT tofu:                   - controller = {
01:01:01.106 STDOUT tofu:                       - logLevel = "info"
01:01:01.106 STDOUT tofu:                     }
01:01:01.106 STDOUT tofu:                   - crds       = {
01:01:01.106 STDOUT tofu:                       - enabled = true
01:01:01.106 STDOUT tofu:                     }
01:01:01.106 STDOUT tofu:                   - speaker    = {
01:01:01.106 STDOUT tofu:                       - logLevel = "info"
01:01:01.106 STDOUT tofu:                     }
01:01:01.106 STDOUT tofu:                 }
01:01:01.106 STDOUT tofu:             ) -> (known after apply)
01:01:01.106 STDOUT tofu:           ~ version        = "0.14.9" -> (known after apply)
01:01:01.106 STDOUT tofu:         } -> (known after apply)
01:01:01.106 STDOUT tofu:         name                       = "metallb"
01:01:01.106 STDOUT tofu:       ~ version                    = "0.14.9" -> "0.15.0"
01:01:01.106 STDOUT tofu:         # (26 unchanged attributes hidden)
01:01:01.106 STDOUT tofu:     }
01:01:01.106 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:01.106 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/metallb -w terragrunt_kubernetes_metallb
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fmetallb%252Fterragrunt_kubernetes_metallb)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/metallb -w terragrunt_kubernetes_metallb
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```